Revit 2024 API
RowHeightOverrideOptions Enumeration
 Describes the options for overriding schedule body row heights (applied when viewed as a ScheduleSheetInstance on a ViewSheet).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Since: 2024
Syntax
C#
public enum RowHeightOverrideOptions
Visual Basic
Public Enumeration RowHeightOverrideOptions
Visual C++
public enum class RowHeightOverrideOptions
Members
Member name | Description
None |  No override would be applied for the row height.
All |  Override row height for any body rows in the schedule.
ImageRows |  Override row height for body rows containing images in the schedule.
See Also
Autodesk.Revit.DB Namespace